Repository: henkdegroot/jamuluswebsite
Catalog: _translator-files/po/*/Installation-for-Linux.po
Languages: es

source: en
es: es

source: Installation for Linux
es: Instalación en Linux

source: {% include breadcrumb.html root="Using Jamulus" branch1="Getting Started" branch1-url="Getting-Started" %}
es: {% include breadcrumb.html root="Utilización de Jamulus" branch1="Cómo Empezar" branch1-url="Getting-Started" %}

source: Make sure you read the [Getting Started](Getting-Started) page.
es: Asegúrate de haber leído la página de [Cómo Empezar](Getting-Started).

source: **Upgrading?** You may want to [back up your configuration](Software-Manual#backing-up-jamulus) first.
es: **¿Actualizando?** Quizá te convenga [realizar una copia de seguridad de tu configuración](Software-Manual#copia-seguridad-jamulus) primero.

source: **Installing a server?** Read the [guide for server adminstrators](Running-a-Server) first.
es: **¿Instalando un Servidor?** Primero lee la [guía para los administradores de Servidores](Running-a-Server).

source: Debian and Ubuntu
es: Debian y Ubuntu

source: Using the official Repository (recommended)
es: Utilizar el repositorio oficial (recomendado)

source: We provide a repository for Debian and Ubuntu based distributions that allows automatic updates alongside your other system updates. To use the repository:
es: Proporcionamos un repositorio para distribuciones basadas en Debian y Ubuntu que permite las actualizaciones automáticas junto con las demás actualizaciones del sistema. Para utilizar el repositorio:

source: Open your Terminal (CTRL+ALT+T should work)
es: Abre tu Terminal (CTRL+ALT+T debería funcionar)

source: *Ubuntu only* - Enable the Ubuntu "universe" repository (you can use the [GUI-based approach](https://askubuntu.com/a/148645) or [CLI-based approach](https://askubuntu.com/a/227788)).
es: *Solo Ubuntu* - Habilita el repositorio "universe" de Ubuntu (puedes usar la [interfaz gráfica](https://askubuntu.com/a/148645) o [la línea de comandos](https://askubuntu.com/a/227788)).

source: Download the repository setup script:\\
es: Descarga el script de instalación del repositorio:\\

source: Make the script executable:\\
es: Haz que el script sea ejecutable:\\

source: Run the setup script and install Jamulus:\\
es: Ejecuta el script de instalación e instala Jamulus:\\

source: Installing the .deb files manually
es: Instalación manual de los archivos .deb

source: Download Jamulus for your architecture: [amd64]({{ site.download_root_link }}{{ site.download_file_names.deb-gui }}), [armf]({{ site.download_root_link }}{{ site.download_file_names.deb-gui-armhf }}) or [arm64]({{ site.download_root_link }}{{ site.download_file_names.deb-gui-arm64 }})
es: Descarga Jamulus para tu arquitectura: [amd64]({{ site.download_root_link }}{ site.download_file_names.deb-gui }}), [armf]({{ site.download_root_link }}{ site.download_file_names.deb-gui-armhf }}) o [arm64]({{ site.download_root_link }}{ site.download_file_names.deb-gui-arm64 }})

source: Update apt by opening a console window (CTRL+ALT+T should work) and type: `sudo apt-get update`
es: Actualiza apt abriendo una consola (CTRL+ALT+T debería funcionar) y escribe: `sudo apt-get update`

source: Go to where you downloaded the installer and either double-click on it, or use the command line: `sudo apt install ./{{ site.download_file_names.deb-gui }}` (or for Raspberry Pi etc. as above)
es: Ve al lugar donde descargaste el instalador y haz doble clic en él, o utiliza la línea de comandos: `sudo apt install ./{{ site.download_file_names.deb-gui }}` (o para Raspberry Pi, etc., como arriba)

source: Once installed, you can delete the file and close any console windows.
es: Una vez instalado, puedes eliminar el archivo y cerrar las ventanas de consolas.

source: **Upgrades:** If you need to upgrade Jamulus to a newer version and install Jamulus manually, just download the new .deb file and re-install as above.
es: **Actualizaciones:** Si necesitas actualizar Jamulus a una versión más reciente e instalar Jamulus manualmente, sólo tienes que descargar el nuevo archivo .deb y volver a instalar como se indica más arriba.

source: Other distributions
es: Otras distribuciones

source: For installers on other distributions, see their package managers and [Repology](https://repology.org/project/jamulus/versions). If an up-to-date version of Jamulus is not included in your distribution, you can [compile Jamulus from source](https://github.com/jamulussoftware/jamulus/blob/main/COMPILING.md). Note also the contributed [installation scripts](https://github.com/jamulussoftware/installscripts).
es: Para instaladores en otras distribuciones, consulta sus gestores de paquetes y [Repology](https://repology.org/project/jamulus/versions). Si tu distribución no incluye una versión actualizada de Jamulus, puedes [compilar Jamulus de las fuentes](https://github.com/jamulussoftware/jamulus/blob/main/COMPILING.md). También se han contribuido [scripts de instalación](https://github.com/jamulussoftware/installscripts).

source: Set up your hardware
es: Configura tu hardware

source: The Jamulus Client needs to connect to a running [JACK](https://jackaudio.org/) server in order to start. You need to find out which is the low-latency sound server for your distribution. - If your distribution uses [JACK](https://jackaudio.org/), see how to [configure JACK with QjackCtl](Installation-for-Linux#configure-jack-with-qjackctl). - If your distribution uses PipeWire, see how to [configure PipeWire](Installation-for-Linux#configure-pipewire).
es: El Cliente Jamulus necesita conectarse a un servidor [JACK](https://jackaudio.org/) en ejecución para poder arrancar. Necesitas averiguar cuál es el servidor de sonido de baja latencia para tu distribución. - Si tu distribución usa [JACK] (https://jackaudio.org/), mira cómo [configurar JACK con QjackCtl](Installation-for-Linux#configurar-jack-con-qjackctl). - Si tu distribución usa PipeWire, mira cómo [configurar PipeWire](Installation-for-Linux#configurar-pipewire).

source: Configure JACK with QjackCtl
es: Configurar JACK con QJackCtl

source: To run a [JACK](https://jackaudio.org/) server, the recommended method is to use `QjackCtl`.
es: Para ejecutar un servidor [JACK](https://jackaudio.org/), el método recomendado es utilizar `QjackCtl`.

source: Launch QjackCtl. You will see the **Qt JACK Control utility main page**.
es: Inicia QjackCtl. Verás la página principal de la utilidad **Qt JACK Control**.

source: Configure your sound hardware as follows:
es: Configura tu hardware de sonido como se indica a continuación:

source: Set the audio **Interface** to the one you want (there may be several in the list - choose the correct one as this cannot be changed without stopping Jamulus and JACK).
es: Establece la **Interfaz** de audio que desees (puede haber varias en la lista - elije la correcta ya que no puede cambiarse sin detener Jamulus y JACK).

source: Set the **Sample Rate to 48000**.
es: Establece la **Frecuencia de Muestreo en 48000**.

source: Set the **Frames/Period to 128** and **Periods/Buffer at 2** at first.
es: Establece los **Cuadros/Periodo en 128** y los **Periodos/Buffer a 2** al principio.

source: Restart JACK for the new settings to take effect and continue from the [Start Jamulus](Installation-for-Linux#start-jamulus) section below.
es: Reinicia JACK para que la nueva configuración surta efecto y continúa desde la sección [Inicia Jamulus](Installation-for-Linux#inicia-jamulus) más abajo.

source: Configure PipeWire
es: Configurar PipeWire

source: PipeWire provides its own JACK server. When you launch the Jamulus Client, PipeWire automatically runs a JACK server. However, there are a few parameters to adjust. You need to set your audio interface to the "pro-audio" profile and define PipeWire's "rate" and "quantum" parameters beforehand. You can find more information about the configuration in the [PipeWire wiki](https://gitlab.freedesktop.org/pipewire/pipewire/-/wikis/Config-JACK#jack-server).
es: PipeWire proporciona su propio servidor JACK. Al iniciar el cliente Jamulus, PipeWire ejecuta automáticamente un servidor JACK. Sin embargo, hay algunos parámetros que ajustar. Debes configurar tu interfaz de audio con el perfil "pro-audio" y definir previamente los parámetros "rate" y "quantum" de PipeWire. Puedes encontrar más información sobre la configuración en el [wiki de PipeWire](https://gitlab.freedesktop.org/pipewire/pipewire/-/wikis/Config-JACK#jack-server).

source: To set up your system: 1. Open `pavucontrol` (the audio mixer) and choose the "pro-audio" profile for your sound hardware in the configuration tab. 2. In a terminal use the following two commands to force PipeWire's rate and quantum:
es: Para configurar tu sistema: 1. Abre `pavucontrol` (el mezclador de audio) y elige el perfil "pro-audio" para tu hardware de sonido en la pestaña de configuración. 2. En un terminal utiliza los dos comandos siguientes para forzar la velocidad y el quantum de PipeWire:

source: After this, continue from the [Start Jamulus](Installation-for-Linux#start-jamulus) section below.
es: Después de esto, continúa desde la sección [Iniciar Jamulus](Installation-for-Linux#inicia-jamulus) más abajo.

source: Start Jamulus
es: Inicia Jamulus

source: With JACK or PipeWire configured, launch Jamulus.
es: Con JACK o PipeWire configurados, inicia Jamulus.

source: If you have any problems, first check [the troubleshooting page](Client-Troubleshooting).
es: Si tienes algún problema, consulta primero [la página de solución de problemas](Client-Troubleshooting).

source: All installed?
es: ¿Todo instalado?

source: Take a look at the
es: Echa un vistazo a la

source: [Getting Started page](Getting-Started){: .button}
es: [página de Cómo Empezar](Getting-Started){: .button}
